In [2]:
import numpy as np
import pandas as pd

In [6]:
dict = {
    "name":["Souradeep","Aman","Raj","Deep"],
    "age":[23,21,20,24],
    "roll":[71,2,25,34]
}

In [7]:
dict

{'name': ['Souradeep', 'Aman', 'Raj', 'Deep'],
 'age': [23, 21, 20, 24],
 'roll': [71, 2, 25, 34]}

In [8]:
df=pd.DataFrame(dict)

In [9]:
df

        name  age  roll
0  Souradeep   23    71
1       Aman   21     2
2        Raj   20    25
3       Deep   24    34

In [10]:
df.to_csv('abc.csv')

In [11]:
df.head(3)

        name  age  roll
0  Souradeep   23    71
1       Aman   21     2
2        Raj   20    25

In [12]:
df.tail(2)

   name  age  roll
2   Raj   20    25
3  Deep   24    34

In [13]:
df.describe()

             age       roll
count   4.000000   4.000000
mean   22.000000  33.000000
std     1.825742  28.693786
min    20.000000   2.000000
25%    20.750000  19.250000
50%    22.000000  29.500000
75%    23.250000  43.250000
max    24.000000  71.000000